{"pageProps":{"postData":{"slug":"databases","htmlData":"<p>A <strong>database</strong> is an organized collection of data. A <strong>database management system</strong>(DBMS) is a software system that acts as a middle-man between the database itself and end users(applications, admins). Commons features of DBMSs include:</p>\n<ul>\n<li>data definition/retrieval/update</li>\n<li>transactions</li>\n<li>authorization</li>\n<li>concurrency</li>\n<li>etc</li>\n</ul>\n<p>People classify DBMSs according to <strong>data models</strong> they support.</p>\n<blockquote>\n<p>The data model of a DBMS specifies how data is stored, related and manipulated.</p>\n</blockquote>\n<blockquote>\n<p>With relation databases, schema means database, relation means table, domain/attribute means column, and tuple means row.</p>\n</blockquote>\n<h2>History</h2>\n<p>The development of database technologies can be divided into three based on their data models:</p>\n<ol>\n<li>\n<p>Navigational: A type of database in which records are discovred/processed by following references from one record to another. The invention of direct-access storage devices made this possible as programmers now are not restricted by sequential access manner of earlier storage devices; they can choose any arbitrary route to access a record, given that another record has a reference pointing to it.</p>\n</li>\n<li>\n<p>Relational/SQL: Developed by Edgar Frank Codd, the model deviated from the usage of linked-lists for storing records to using tables (reasons of which we discuss below).</p>\n<p>Codd used terms relations(tables), tuples(rows) and domains(columns) in his description of the model. The relational model assigns a seperate table for each entity. Each table has a fixed-number of columns containing the entity's attributes. One or more of these columns function as a primary key, which uniquely identifies each row in the table. When a record in a table needs to reference a record in another table, the primary key is used rather than record's physical address, unlike the navigational model. Having entity's data stored in normalized forms ensure that each \"fact\" is stored only once, consequently simplifying update operations. Virtual tables, called views, are saved queries(just query itself, not its resulting set) and exposed to users, essentially work as a proxy table over original tables in the database.</p>\n<p>Entity-relationship(ER) data model, designed by Peter Chen, is an abstract data model gained popularity in database design, especially in relational model. It described interrelated things(tables in our case) by means of different entities, relationships, etc. It had more familiar(easy-to-understand) description than that of earlier relational model. Therefore, ER model was retrofitted as a data modeling construct for the relational model.</p>\n<p>Near to the end of Relational era, we see the rise of object oriented progamming. OOP model is based on software engineering principles. And relaional model is based on mathematical principles, as discussed above. The fact that two models do not have same model leads to a set of difficulties known as <strong>object-relational impedance mismatch</strong>. Object databases and object-relational databases try to address these difficulties. Libraries, known as object-relational mappings(ORMs), try to solve the problem on the programming side.</p>\n</li>\n<li>\n<p>Post-relational:</p>\n</li>\n</ol>\n<h3>Navigational vs Relational</h3>\n<p>Say we want to store data about users having the following attributes: name, surname, DOB, addresses and phone numbers. In navigational model, we would place all these attributes in a single variable-length record. Whereas in relational model, we would store them in user, address, and phone number tables. A record would be created only if the user had the data.</p>\n<p>Let's now compare how two models would query data. In the former model, we gather data by following references. In other words, a programmer writes a code in which he tells <strong>how</strong> should the program route (through the links) in order to get/collect the requested data. So, the efficiency is proportional to how well is the programmer.</p>\n<p>Things quite differ in the latter model. Given the fact that the former model is relational that has its own mathematical system called <strong>relational calculus</strong>, we can derive a <strong>declarative</strong> query language that exploits the relational calculus in optimizing the query. This is doable as now our queries are expressed in a mathematical logic(rather than program steps as in the case with the former model) that is isomorphic with relational calculus and therefore techniques and theorems from set theory can be exploited. As a result we take the responsibility of finding an efficient path from programmer and put it on DBMSs.</p>\n","title":"A walk in the park of databases","date":"2021-08-31","description":"We discuss database history, classification, models, and many more."}},"__N_SSG":true}